; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v4 - type_1 ?v5 - type_3)
 	      (pred_4 ?v3 - object ?v5 - type_3)
	      (pred_3 ?v4 - type_1 ?v6 - type_2)
	      (pred_1 ?v4 - type_1 ?v3 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v4 - type_1 ?v8 ?v1 - type_3)
       :precondition (and  (pred_2 ?v4 ?v8))
       :effect (and  (pred_2 ?v4 ?v1)
		     (not (pred_2 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_1 ?v2 - object ?v7 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_2 ?v4 ?v7) (pred_3 ?v4 ?v6))
       :effect (and (pred_1 ?v4 ?v2 ?v6)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_3 ?v4 ?v6))))

   (:action op_3
       :parameters (?v4 - type_1 ?v2 - object ?v7 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v2 ?v6) (pred_2 ?v4 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_3 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v2 ?v6)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_02 obj_01 - type_1
obj_09 obj_11 obj_06 obj_03 - type_2
obj_08 obj_07 obj_10 - type_3
obj_05 obj_04 - object)
(:init
(pred_2 obj_02 obj_08)
(pred_3 obj_02 obj_09)
(pred_3 obj_02 obj_11)
(pred_2 obj_01 obj_08)
(pred_3 obj_01 obj_06)
(pred_3 obj_01 obj_03)
(pred_4 obj_05 obj_08)
(pred_4 obj_04 obj_10)
)
(:goal
(and
(pred_4 obj_05 obj_08)
(pred_4 obj_04 obj_08)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_10)))
)
)

; plan
1. (op_1 obj_01 obj_08 obj_10)
   deleted: (pred_2 obj_01 obj_08)
   added: (pred_2 obj_01 obj_10)
   goals met: 1 of 2
2. (op_2 obj_01 obj_04 obj_10 obj_03)
   deleted: (pred_4 obj_04 obj_10) (pred_3 obj_01 obj_03)
   added: (pred_1 obj_01 obj_04 obj_03)
   goals met: 1 of 2
3. (op_1 obj_01 obj_10 obj_08)
   deleted: (pred_2 obj_01 obj_10)
   added: (pred_2 obj_01 obj_08)
   goals met: 1 of 2
4. (op_3 obj_01 obj_04 obj_08 obj_03)
   deleted: (pred_1 obj_01 obj_04 obj_03)
   added: (pred_4 obj_04 obj_08) (pred_3 obj_01 obj_03)
   goals met: 2 of 2
